// 과일 및 야채
const fruitsAndVeggies = [
  '🍏',
  '🍎',
  '🍐',
  '🍊',
  '🍋',
  '🍈',
  '🍌',
  '🍉',
  '🍇',
  '🍓',
  '🍒',
  '🍑',
  '🍍',
  '🥭',
  '🥥',
  '🥝',
  '🫐',
  '🍅',
  '🥑',
  '🍆',
  '🥦',
  '🥬',
  '🥒',
  '🌶️',
  '🌽',
  '🥕',
  '🫑',
  '🫒',
  '🧄',
  '🧅',
  '🥔',
  '🍠',
];

// 빵 및 곡류
const breadAndGrains = ['🥐', '🥖', '🍞', '🥨', '🥯', '🫓', '🍘', '🍙', '🍚', '🍛', '🍜', '🍝', '🍲', '🥞', '🧇', '🥧'];

// 단백질 및 고기류
const proteinAndMeat = ['🍖', '🍗', '🥩', '🥓', '🧆', '🍤', '🦞', '🦀', '🦪', '🥚', '🍳', '🧀'];

// 패스트푸드 및 샌드위치류
const fastFoodAndSandwiches = ['🍔', '🍟', '🍕', '🌭', '🥪', '🌮', '🌯', '🫔', '🥙'];

// 국수 및 밥류
const noodlesAndRice = ['🍝', '🍜', '🍲', '🥘', '🫕', '🍛', '🍚', '🍣', '🍙', '🍘', '🍤', '🍥', '🥟', '🥠', '🥡'];

// 디저트 및 간식
const dessertsAndSnacks = [
  '🍦',
  '🍧',
  '🍨',
  '🎂',
  '🍰',
  '🧁',
  '🍪',
  '🍩',
  '🍫',
  '🍬',
  '🍭',
  '🍮',
  '🍡',
  '🥧',
  '🍯',
  '🥮',
  '🥫',
];

// 음료
const beverages = [
  '☕',
  '🍵',
  '🫖',
  '🧉',
  '🥤',
  '🧃',
  '🥛',
  '🧋',
  '🍺',
  '🍻',
  '🍷',
  '🍶',
  '🍾',
  '🥂',
  '🍸',
  '🍹',
  '🥃',
  '🧊',
  '🫗',
];

// 조리 도구 및 기타
const cookingToolsAndOthers = ['🍴', '🥄', '🍽️', '🧂', '🍱', '🥣', '🧈'];

export const foodTypes = [
  '과일 & 채소',
  '곡류 & 빵',
  '육류 & 단백질',
  '패스트푸드 & 샌드위치',
  '밥 & 국수',
  '스낵 & 디저트',
  '음료',
  '조리 도구',
];

export const foodEmojis = {
  fruitsAndVeggies,
  breadAndGrains,
  proteinAndMeat,
  fastFoodAndSandwiches,
  noodlesAndRice,
  dessertsAndSnacks,
  beverages,
  cookingToolsAndOthers,
};
